-- Вывести 10 человек, которые получали какие-либо премии за фильмы, в которых участвовали в двух или более качествах
SELECT p.firstname , p.lastname ,  count(pp.peopleid) as count
FROM moviepeople pp , people p
WHERE p.peopleid = pp.peopleid
GROUP BY p.peopleid
ORDER BY count DESC
LIMIT 10;


-- Вывести 10 самых успешных деятелей кино (максимальное количество наград) за заданный период времени.
-- При одинаковом количестве наград вторым показателем успешности необходимо считать общее количество фильмов,
-- в которых принималось участие.
